app/controllers/admin_controller.rb

SELECT "proyectos".* FROM "proyectos" ORDER BY created_at desc LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "proyectos"
SELECT "users".* FROM "users"
---
  def index

     @proyectos = Proyecto.all
     @total_proyectos = Proyecto.count
     @users = User.all