app/controllers/display_controller.rb

SELECT "proyectos".* FROM "proyectos" ORDER BY created_at desc LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "proyectos"
---
  def index
    @proyectos = Proyecto.paginate :page=>params[:page], :order=>'created_at desc', :per_page => 1