app/controllers/proyectos_controller.rb

SELECT "proyectos".* FROM "proyectos"
---
  def index
    @proyectos = Proyecto.all

SELECT "proyectos".* FROM "proyectos" WHERE "proyectos"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @proyecto = Proyecto.find(params[:id])

SELECT "proyectos".* FROM "proyectos" WHERE "proyectos"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @proyecto = Proyecto.find(params[:id])

INSERT INTO "proyectos" ("created_at", "description", "image_url", "name", "type_pr", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 04 Oct 2011 19:13:39 UTC +00:00], ["description", ""], ["image_url", ""], ["name", ""], ["type_pr", ""], ["updated_at", Tue, 04 Oct 2011 19:13:39 UTC +00:00]]
---
  def create
    @proyecto = Proyecto.new(params[:proyecto])

    respond_to do |format|
      if @proyecto.save

SELECT "proyectos".* FROM "proyectos" WHERE "proyectos"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "proyectos" SET "description" = 'Es una plataforma apara evitar emosiones', "updated_at" = '2011-10-04 19:15:15.917441', "type_pr" = 'Proyecto de iniciativa propia', "image_url" = 'aventones.png', "name" = 'Aventones' WHERE "proyectos"."id" = 1
---
  def update
    @proyecto = Proyecto.find(params[:id])

    respond_to do |format|
      if @proyecto.update_attributes(params[:proyecto])

SELECT "proyectos".* FROM "proyectos" WHERE "proyectos"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "proyectos" WHERE "proyectos"."id" = ?  [["id", 2]]
---
  def destroy
    @proyecto = Proyecto.find(params[:id])
    @proyecto.destroy