app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY name
---
  def index
    @users = User.order(:name)

INSERT INTO "users" ("created_at", "hashed_password", "name", "salt", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save